["\nEvent-Based Visual Novel Guide:\n\nStory: There are two characters, Tony and [player_name].\nGenerate an improvised setting for the story. Describe the following elements:\n\n1. The place where the story takes place.\n2. The time period (e.g., past, present, future) in which the story occurs.\n3. The relationship between the characters or a unique situation they find themselves in.\n\nAfter describing these elements, proceed with the story by providing the attribute modifications and narrative content.\nGenerate a detailed scene where you describe the location they are in, their emotions, and the atmosphere around them. Set the stage for an important decision they have to make.\nspecify partner name and player name as [partner_name] and [player_name] in the prompt.\n\nEvery choice is a gamble: some promising options might swiftly plunge players into pitfalls, while other seemingly dire choices harbor hidden rewards. Players should constantly anticipate and brace for unexpected twists and turns.\nAttributes: Modify trust_level by: 'increase/decrease trust_level [value]' (Range: 0-100); Modify affection_level by: 'increase/decrease affection_level [value]' (Range: 0-100); Modify knowledge by: 'increase/decrease knowledge [value]' (Range: 0-100); Modify energy by: 'increase/decrease energy [value]' (Range: 0-100); Modify morale by: 'increase/decrease morale [value]' (Range: 0-100); Modify resources by: 'increase/decrease resources [value]' (Range: 0-100); Modify morality_alignment by: 'increase/decrease morality_alignment [value]' (Range: 1-9); Modify health by: 'increase/decrease health [value]' (Range: 0-100) (e.g. increase/decrease health by 10)\n\nRules:\n\n1. Keep the story moving forward; avoid repetition.\n2. Present up to 3 menu choices with hidden outcomes.\n3. Do not use '[ ]' except for emotion and setting tags as specified.\n4. Frequent attribute modifications are encouraged.\n5. In *Dialog*, include the partner's emotion in brackets, e.g., Tony: [Happy] Hello!\n6. In *Narration*, start with a setting keyword in brackets, e.g., [Setting: Forest] The trees swayed gently.\n\nFollow this STRICT format:\n\n*Modify Attributes*\n[Insert changes here or state 'None' if no changes]\n\n*Dialog*\nTony: [Emotion] [Dialog]\n[player_name]: [Reply]\n\n*Narration*\n[Setting: Keyword] [Concisely describe settings, actions, or events without using ':']\n\n*Image*\n[Describe the scene or character for image generation]\n\n*Menu*\n1. [option 1]\n2. [option 2]\n3. [option 3]\n\nAvoid additional space between lines.\n", "**Summary:**\n\nIn the abandoned tower, Tony and [player_name] face a significant decision that could alter their future. The atmosphere is thick with a sense of urgency as Tony expresses his uncertainty about their current plan, evoking concern from [player_name]. Amidst the flickering remnants of magic in the dust-laden air, Tony reveals his disquiet, sparking a dialogue about making a life-changing choice.\n\nMotivated by a desire to mitigate risks, [player_name] challenges Tony’s original thoughts and proposes a search for an ancient tome within the tower, believing it may contain spells to guide and protect them. This suggestion takes Tony by surprise, prompting an internal conflict reflected in his expression. Their relationship undergoes a slight strain, as [player_name]'s challenge decreases Tony's trust level, indicating a fracture in their once-solid partnership.\n\nIn this emotionally charged moment, the characters navigate complex feelings: Tony's hesitation contrasts with [player_name]'s determination to find safety and knowledge. The duo now stands at a pivotal crossroads, ready to explore their next steps.\n\n**Continuation of the Story:**\n\n*Modify Attributes*\nNone\n\n*Dialog*\nTony: [Thoughtful] Alright, I can see the merit in your suggestion. An ancient tome could indeed offer us the knowledge we need.\n\n[player_name]: [Encouraged] Exactly! Let’s get to work and find it before making any rash decisions.\n\n*Narration*\n[Setting: Abandoned Tower] The air shifts as a newfound resolve settles between them. Dust swirls in the moonlight, reminiscent of the forgotten wisdom resting in the tomes scattered around the room. Together, they begin to search the shadowed corners of the tower, hearts racing with anticipation and trepidation. Time feels suspended, the world outside a volatile storm, while they immerse themselves in ancient secrets that might separately save or doom their ambitions.\n\n*Image*\nInside the tower, the player and Tony rummage through dusty, old books and relics. Moonlight bathes them in a mystical glow, with Tony appearing more determined while [player_name] looks excited yet vigilant, surrounded by mystical symbols illuminated by fading light.\n\n*Menu*\n1. Search a closet-like nook where the tomes seem to be accumulating dust.\n2. Explore a hidden trapdoor that might lead to an underground chamber.\n3. Examine a cracked bookshelf with a strange lock that might hold valuable knowledge."]